Repository: Al-Najd/iOS
Catalog: Shared/Localization/*.lproj/Localizables.strings
Languages: ar

# generic_error
source: Oops... Something went wrong!
ar: حدث خطأ ما...

# email_not_valid
source: This email is not valid.
ar: هذا الإيمال غير صالح.

# password_too_short
source: Password is too short.
ar: كلمة المرور قصيرة للغاية

source: Names can't contain numbers.
ar: الأسماء لا يوجد فيها أرقام

source: Names can't contain special characters.
ar: الأسماء لا يوجد فيها حروف غريبة.

source: Names can't contain emojis.
ar: الأسماء لا يوجد فيها ايموجيز.

# field_cant_be_empty
source: The %@ can't be empty.
ar: ال%@ لا يمكن ان يكون فارغا.

# password_hint_unlocked
source: Your Super Secret Password.
ar: كلمة المرور.

source: Your current password
ar: كلمة المرور الحالية

source: Category Name: %@
ar: اسم الفئة: %@

source: Category Description: %@
ar: وصف الفئة: %@

source: Category Calories: %@
ar: عدد السعرات الحرارية: %@
