// swiftlint:disable all
// Generated using SwiftGen — https://github.com/SwiftGen/SwiftGen

import Foundation

// MARK: - L10n

// swiftlint:disable superfluous_disable_command file_length implicit_return prefer_self_in_static_references

// swiftlint:disable explicit_type_interface function_parameter_count identifier_name line_length
// swiftlint:disable nesting type_body_length type_name vertical_whitespace_opening_braces
public enum L10n {
    /// الآن اصبحت التوبة اسهل, كذلك حلول المشاكل
    public static let aasrReward = L10n.tr("Localizable", "aasr_reward", fallback: "الآن اصبحت التوبة اسهل, كذلك حلول المشاكل")
    /// احاديث
    public static let ahadeeth = L10n.tr("Localizable", "ahadeeth", fallback: "احاديث")
    /// الفرض
    public static let alfard = L10n.tr("Localizable", "alfard", fallback: "الفرض")
    /// الحمدلله
    public static let alhamdulellah = L10n.tr("Localizable", "alhamdulellah", fallback: "الحمدلله")
    /// الله اكبر
    public static let allahuakbar = L10n.tr("Localizable", "allahuakbar", fallback: "الله اكبر")
    /// اللهم انت السلام, ومنك السلام, تباركت يا ذا الجلال و الإكرام
    public static let antAlSalam = L10n.tr(
        "Localizable",
        "ant_al_salam",
        fallback: "اللهم انت السلام, ومنك السلام, تباركت يا ذا الجلال و الإكرام")
    /// سورة الناس
    public static let ayatAlAlnas = L10n.tr("Localizable", "ayat_al_alnas", fallback: "سورة الناس")
    /// سورة الفلق
    public static let ayatAlFalaq = L10n.tr("Localizable", "ayat_al_falaq", fallback: "سورة الفلق")
    /// سورة الإخلاص
    public static let ayatAlIkhlas = L10n.tr("Localizable", "ayat_al_ikhlas", fallback: "سورة الإخلاص")
    /// آية الكرسي
    public static let ayatAlKursi = L10n.tr("Localizable", "ayat_al_kursi", fallback: "آية الكرسي")
    /// Localizables.strings
    ///   Proba B.V.
    ///
    ///   Created by Ahmed Ramy on 10/1/20.
    /// //  Copyright © 2020 Proba B.V. All rights reserved.
    ///   Copyright © 2020 Proba B.V. All rights reserved.
    public static func azkarDurationTitleTitle(_ p1: Any) -> String {
        L10n.tr("Localizable", "azkar_durationTitle_title", String(describing: p1), fallback: "%@ من الذكر")
    }

    /// Plural format key: "%#@daysCount@"
    public static func daysCount(_ p1: Int) -> String {
        L10n.tr("Localizable", "days_count", p1, fallback: "Plural format key: \"%#@daysCount@\"")
    }

    /// انت شغال كويس, عاش جدا!
    /// كمل 🔥
    public static let doingGreat = L10n.tr("Localizable", "doing_great", fallback: "انت شغال كويس, عاش جدا!\nكمل 🔥")
    /// حين يغشاك هم, وحين يثقل كاهلك دين, حين تتهم ظلم, وحين تفقد حبيبا, او تفارق عزيزا, حين تخطلت عليك الامور ويصعب عليك الاختيار, حين يهجم عليك الامتحان والاختبار, فأعلم, ان لك ربا, هو علي كل شئ قدير, وكل شئ عليه هين, فقط... توجه بقلبك, وادع ربك, إن يردك بخير, فلا راد لفضله, يصيب به من يشاء من عباده و هو الغفور الرحيم, ((إن كان لك حاجة, وليست لك قدرة, فإن لك ربا, له قدرة وليس له حاجة, ((يا أيها الناس, انتم الفقراء الي الله, والله هو الغني الحميد)) مهما كانت حاجتك, مهما بلغت شدتك, ومهما كانت قضيتك, هي علي الله شئ هين, ((اللذي خلقني فهو يهدين, واللذي هو يطعمن ويسقين, وإذا مرضت فهو يشفين)), انت اللذي صورتني, وخلقتني, وهديتني لشرائع الإيمان, انت اللذي اطعمتني, وسقيتني من غير كسب يد ولا دكان, انت اللذي آويتني, وحبوتني, وهديتني من حيرة الخزلان, وزرعت لي بين القلوب مودة, العفو منك برحمة وحنان, ونشرت لي في العالمين محاسنا, وسترت عن ابصارهم عصياني, فلك المحامد و المدائح كلها, بخواتري, وجوارحي, ولساني))
    public static let dua1 = L10n.tr(
        "Localizable",
        "dua_1",
        fallback: "حين يغشاك هم, وحين يثقل كاهلك دين, حين تتهم ظلم, وحين تفقد حبيبا, او تفارق عزيزا, حين تخطلت عليك الامور ويصعب عليك الاختيار, حين يهجم عليك الامتحان والاختبار, فأعلم, ان لك ربا, هو علي كل شئ قدير, وكل شئ عليه هين, فقط... توجه بقلبك, وادع ربك, إن يردك بخير, فلا راد لفضله, يصيب به من يشاء من عباده و هو الغفور الرحيم, ((إن كان لك حاجة, وليست لك قدرة, فإن لك ربا, له قدرة وليس له حاجة, ((يا أيها الناس, انتم الفقراء الي الله, والله هو الغني الحميد)) مهما كانت حاجتك, مهما بلغت شدتك, ومهما كانت قضيتك, هي علي الله شئ هين, ((اللذي خلقني فهو يهدين, واللذي هو يطعمن ويسقين, وإذا مرضت فهو يشفين)), انت اللذي صورتني, وخلقتني, وهديتني لشرائع الإيمان, انت اللذي اطعمتني, وسقيتني من غير كسب يد ولا دكان, انت اللذي آويتني, وحبوتني, وهديتني من حيرة الخزلان, وزرعت لي بين القلوب مودة, العفو منك برحمة وحنان, ونشرت لي في العالمين محاسنا, وسترت عن ابصارهم عصياني, فلك المحامد و المدائح كلها, بخواتري, وجوارحي, ولساني))")
    /// اللَّهُمَّ إنِّي أَسْأَلُك مِنْ فَضْلِكَ وَرَحْمَتِكَ، فَإِنَّهُ لاَ يَمْلِكُهَا إِلاَّ أَنْتَ و اللهم اصلح نفوسنا
    public static let dua10 = L10n.tr(
        "Localizable",
        "dua_10",
        fallback: "اللَّهُمَّ إنِّي أَسْأَلُك مِنْ فَضْلِكَ وَرَحْمَتِكَ، فَإِنَّهُ لاَ يَمْلِكُهَا إِلاَّ أَنْتَ و اللهم اصلح نفوسنا")
    /// اللَّهُمَّ إنِّي أَسْأَلُك مِنْ فَضْلِكَ وَرَحْمَتِكَ، فَإِنَّهُ لاَ يَمْلِكُهَا إِلاَّ أَنْتَ و اللهم اصلح نفوسنا
    public static let dua11 = L10n.tr(
        "Localizable",
        "dua_11",
        fallback: "اللَّهُمَّ إنِّي أَسْأَلُك مِنْ فَضْلِكَ وَرَحْمَتِكَ، فَإِنَّهُ لاَ يَمْلِكُهَا إِلاَّ أَنْتَ و اللهم اصلح نفوسنا")
    /// اللهم ارزقنا حُسن الخُلق
    public static let dua12 = L10n.tr("Localizable", "dua_12", fallback: "اللهم ارزقنا حُسن الخُلق")
    /// اللهم ارزقنا حفظ القرآن الكريم
    public static let dua13 = L10n.tr("Localizable", "dua_13", fallback: "اللهم ارزقنا حفظ القرآن الكريم")
    /// اللهم انا امنا فغفر لنا ذنوبنا و قنا عذاب النار
    public static let dua14 = L10n.tr("Localizable", "dua_14", fallback: "اللهم انا امنا فغفر لنا ذنوبنا و قنا عذاب النار")
    /// اللهم رضني بما قضيت... وعافني فيما عافيت... حتي لا احب تعجيل ما اخرت... ولا تأخير ما عجلت, فسبحانك انت من تعلم, وما لنا من العلم إلا ما رزقت, فارزقنا من الإيمان ما لا نسئلك ما ليس لنا به علم, سبحانك, انك انت العلي العليم
    public static let dua15 = L10n.tr(
        "Localizable",
        "dua_15",
        fallback: "اللهم رضني بما قضيت... وعافني فيما عافيت... حتي لا احب تعجيل ما اخرت... ولا تأخير ما عجلت, فسبحانك انت من تعلم, وما لنا من العلم إلا ما رزقت, فارزقنا من الإيمان ما لا نسئلك ما ليس لنا به علم, سبحانك, انك انت العلي العليم")
    /// ادعي ان ربنا يفكرك دايما بالتوكل عليه في ادق ادق التفاصيل, و يبقي هو المعين الأول في الدعاء, ثم بعديه السعي و الأخذ بالأسباب
    public static let dua2 = L10n.tr(
        "Localizable",
        "dua_2",
        fallback: "ادعي ان ربنا يفكرك دايما بالتوكل عليه في ادق ادق التفاصيل, و يبقي هو المعين الأول في الدعاء, ثم بعديه السعي و الأخذ بالأسباب")
    /// يا رب خلينا سبب في دخول حد الأسلام
    public static let dua3 = L10n.tr("Localizable", "dua_3", fallback: "يا رب خلينا سبب في دخول حد الأسلام")
    /// اللهم اغفر للمؤمنين والمؤمنات والمسلمين والمسلمات الاحياء منهم والاموات
    public static let dua4 = L10n.tr(
        "Localizable",
        "dua_4",
        fallback: "اللهم اغفر للمؤمنين والمؤمنات والمسلمين والمسلمات الاحياء منهم والاموات")
    /// اللهم زدنا عباده و طاعه لك و إيماناً و وسع رزقنا بالحلال
    public static let dua5 = L10n.tr("Localizable", "dua_5", fallback: "اللهم زدنا عباده و طاعه لك و إيماناً و وسع رزقنا بالحلال")
    /// اللهم متعنا بلقاء وجهك الكريم سبحانك و تعالى و لقاء عبدك و نبيك محمد صلى الله عليه وسلم و ندعيك ان تسقينا من حوض النبي صلى الله عليه وسلم شربةً لا يظمأ بعدها
    public static let dua6 = L10n.tr(
        "Localizable",
        "dua_6",
        fallback: "اللهم متعنا بلقاء وجهك الكريم سبحانك و تعالى و لقاء عبدك و نبيك محمد صلى الله عليه وسلم و ندعيك ان تسقينا من حوض النبي صلى الله عليه وسلم شربةً لا يظمأ بعدها")
    /// ربنا لا تزغ قلوبنا بعد اذ هديتنا و هب لنا من لدنك رحمة, انك انت الوهاب
    public static let dua7 = L10n.tr(
        "Localizable",
        "dua_7",
        fallback: "ربنا لا تزغ قلوبنا بعد اذ هديتنا و هب لنا من لدنك رحمة, انك انت الوهاب")
    /// ربنا اتنا فى الدنيا حسنه و فى الاخره حسنه و قنا عذاب النار
    public static let dua8 = L10n.tr(
        "Localizable",
        "dua_8",
        fallback: "ربنا اتنا فى الدنيا حسنه و فى الاخره حسنه و قنا عذاب النار")
    /// اللَّهُمَّ إِنِّي عَبْدُكَ، ابْنُ عَبْدِكَ، ابْنُ أَمَتِكَ، نَاصِيَتِي بِيَدِكَ، مَاضٍ فِيَّ حُكْمُكَ، عَدْلٌ فِيَّ قَضَاؤُكَ، أَسْأَلُكَ بِكُلِّ اسْمٍ هُوَ لَكَ سَمَّيْتَ بِهِ نَفْسَكَ، أَوْ أَنْزَلْتَهُ فِي كِتَابِكَ، أَوْ عَلَّمْتَهُ أَحَدًا مِنْ خَلْقِكَ، أَوِ اسْتَأْثَرْتَ بِهِ فِي عِلْمِ الْغَيْبِ عِنْدَكَ، أَنْ تَجْعَلَ الْقُرْآنَ رَبِيعَ قَلْبِي، وَنُورَ صَدْرِي، وَجَلَاءَ حُزْنِي، وَذَهَابَ هَمِّي
    public static let dua9 = L10n.tr(
        "Localizable",
        "dua_9",
        fallback: "اللَّهُمَّ إِنِّي عَبْدُكَ، ابْنُ عَبْدِكَ، ابْنُ أَمَتِكَ، نَاصِيَتِي بِيَدِكَ، مَاضٍ فِيَّ حُكْمُكَ، عَدْلٌ فِيَّ قَضَاؤُكَ، أَسْأَلُكَ بِكُلِّ اسْمٍ هُوَ لَكَ سَمَّيْتَ بِهِ نَفْسَكَ، أَوْ أَنْزَلْتَهُ فِي كِتَابِكَ، أَوْ عَلَّمْتَهُ أَحَدًا مِنْ خَلْقِكَ، أَوِ اسْتَأْثَرْتَ بِهِ فِي عِلْمِ الْغَيْبِ عِنْدَكَ، أَنْ تَجْعَلَ الْقُرْآنَ رَبِيعَ قَلْبِي، وَنُورَ صَدْرِي، وَجَلَاءَ حُزْنِي، وَذَهَابَ هَمِّي")
    /// صلاة الآوابين, نعم العباد, الله يمدح و يعتز بعباده الآوابين, فما اكرمها من عبادة ان يمدح الله اهلها و ياله من شرف عظيم, بل يجعل لك ايضا الله في كل عمل لك صدقة, و يجعل علي كل سلامة (عظمة في جسدك) صدقة!
    public static let duhaReward = L10n.tr(
        "Localizable",
        "duha_reward",
        fallback: "صلاة الآوابين, نعم العباد, الله يمدح و يعتز بعباده الآوابين, فما اكرمها من عبادة ان يمدح الله اهلها و ياله من شرف عظيم, بل يجعل لك ايضا الله في كل عمل لك صدقة, و يجعل علي كل سلامة (عظمة في جسدك) صدقة!")
    /// هنالك اكثر من ٢٥ فضل في صلاة الظهر, افضلها انها تقربك من الله
    public static let duhrReward = L10n.tr(
        "Localizable",
        "duhr_reward",
        fallback: "هنالك اكثر من ٢٥ فضل في صلاة الظهر, افضلها انها تقربك من الله")
    /// اصبحت الأن اقرب من الله
    public static let duhrSunnahReward = L10n.tr("Localizable", "duhr_sunnah_reward", fallback: "اصبحت الأن اقرب من الله")
    /// استغفر الله
    public static let estigphar = L10n.tr("Localizable", "estigphar", fallback: "استغفر الله")
    /// إن كانت سنة الفچر خيرا من الدنيا و ما فيها, فما بالك بفرضها؟
    public static let fajrReward = L10n.tr(
        "Localizable",
        "fajr_reward",
        fallback: "إن كانت سنة الفچر خيرا من الدنيا و ما فيها, فما بالك بفرضها؟")
    /// اغني اهل الأرض لصلاتك لسنة الفچر
    public static let fajrSunnahReward = L10n.tr(
        "Localizable",
        "fajr_sunnah_reward",
        fallback: "اغني اهل الأرض لصلاتك لسنة الفچر")
    /// فرض
    public static let fard = L10n.tr("Localizable", "fard", fallback: "فرض")
    /// لم تصل الفرض بعد.
    public static let fardNotDoneYet = L10n.tr("Localizable", "fard_not_done_yet", fallback: "لم تصل الفرض بعد.")
    /// عَنْ أَمِيرِ المُؤمِنينَ أَبي حَفْصٍ عُمَرَ بْنِ الخَطَّابِ قَالَ : سَمِعْتُ رَسُولَ اللهِ ﷺ يَقُولُ:
    ///
    ///  ((إِنَّمَا الأَعْمَالُ بِالنِّيَّاتِ ، وَإنَّمَا لِكُلِّ امْرِىءٍ مَا نَوَى ، فَمَنْ كَانَتْ هِجْرَتُهُ إِلى اللهِ وَرَسُوله فَهِجْرتُهُ إلى اللهِ وَرَسُوُله ، وَمَنْ كَانَتْ هِجْرَتُهُ لِدُنْيَا يُصِيْبُهَا ، أَو امْرأَةٍ يَنْكِحُهَا ، فَهِجْرَتُهُ إِلى مَا هَاجَرَ إلَيْهِ))
    ///
    ///  رواه إماما المحدثين أبو عبدالله محمد بن إسماعيل بن إبراهيم بن المغيرة بن بَرْدِزْبَهْ البخاري ، وأبو الحسين مسلم بن الحجَّاج ين مسلم القشيري النيسابوري ، في صحيحيهما اللَذين هما أصح الكتب المصنفة .
    public static let hadeeth1 = L10n.tr(
        "Localizable",
        "hadeeth_1",
        fallback: "عَنْ أَمِيرِ المُؤمِنينَ أَبي حَفْصٍ عُمَرَ بْنِ الخَطَّابِ قَالَ : سَمِعْتُ رَسُولَ اللهِ ﷺ يَقُولُ:\n\n ((إِنَّمَا الأَعْمَالُ بِالنِّيَّاتِ ، وَإنَّمَا لِكُلِّ امْرِىءٍ مَا نَوَى ، فَمَنْ كَانَتْ هِجْرَتُهُ إِلى اللهِ وَرَسُوله فَهِجْرتُهُ إلى اللهِ وَرَسُوُله ، وَمَنْ كَانَتْ هِجْرَتُهُ لِدُنْيَا يُصِيْبُهَا ، أَو امْرأَةٍ يَنْكِحُهَا ، فَهِجْرَتُهُ إِلى مَا هَاجَرَ إلَيْهِ)) \n\n رواه إماما المحدثين أبو عبدالله محمد بن إسماعيل بن إبراهيم بن المغيرة بن بَرْدِزْبَهْ البخاري ، وأبو الحسين مسلم بن الحجَّاج ين مسلم القشيري النيسابوري ، في صحيحيهما اللَذين هما أصح الكتب المصنفة .")
    /// نْ عُمَرَ رَضِيَ اللهُ تَعَالَى عَنْهُ أقَال : بَيْنَمَا نَحْنُ جُلُوْسٌ عِنْدَ رَسُولِ اللهِ ذَاتَ يَوْمٍ إَذْ طَلَعَ عَلَيْناَ رَجُلٌ شَدِيْدُ بَيَاضِ الثّياب شَدِيْدُ سَوَادِ الشَّعْرِ لاَ يُرَى عَلَيهِ أَثَرُ السَّفَرِ وَلاَ يَعْرِفُهُ مِنا أحَدٌ حَتى جَلَسَ إلَى النبِي فَأَسْنَدَ رُكْبَتَيْهِ إلَى رُكْبَتَيْهِ وَوَضَعَ كَفيْهِ عَلَى فَخِذِيْهِ وَقَالَ : يَا مُحَمَّدُ أَخْبِرْنِي عَنِ الإِسْلاَم ، فَقَالَ رَسُولُ اللهِ ﷺ :
    ///
    /// ((الإِسْلاَمُ أَنْ تَشْهَدَ أَنْ لاَ إلَه إلاَّ اللهُ وَأَنَّ مُحَمَّدَاً رَسُولُ الله ، وَتُقِيْمَ الصَّلاَة ، وَتُؤْتِيَ الزَّكَاةَ ، وَتَصُوْمَ رَمَضَانَ ، وَتَحُجَّ البيْتَ إِنِ اِسْتَطَعتَ إِليْهِ سَبِيْلاً))
    ///
    ///  قَالَ: صَدَقْتَ. فَعجِبْنَا لَهُ يَسْأَلُهُ وَيُصَدِّقُهُ، قَالَ: فَأَخْبِرِنيْ عَنِ الإِيْمَانِ، قَالَ:
    ///
    /// ((أَنْ تُؤمِنَ بِالله، وَمَلاِئكَتِه، وَكُتُبِهِ ، وَرُسُلِهِ ، وَالْيَومِ الآَخِر ، وَتُؤْمِنَ بِالقَدَرِ خَيْرِهِ وَشَرِّهِ))
    ///
    /// قَالَ: صَدَقْتَ، قَالَ فَأخْبِرْنِيْ عَنِ الإِحْسَانِ، قَالَ:
    ///
    /// ((أَنْ تَعْبُدَ اللهَ كَأَنَكَ تَرَاهُ، فَإِنْ لمْ تَكُنْ تَرَاهُ فَإِنَّهُ يَرَاكَ ))
    ///
    /// قَالَ: فَأَخْبِرْنِي عَنِ السَّاعَةِ ، قَالَ :
    ///
    /// ((مَا الْمَسئُوُلُ عَنْهَا بِأَعْلَمَ مِنَ السَّائِلِ))
    ///
    /// قَالَ : فَأخْبِرْنِيْ عَنْ أَمَارَاتِها ، قَالَ :
    ///
    /// ((أَنْ تَلِدَ الأَمَةُ رَبَّتَهَا ، وَأَنْ تَرى الحُفَاةَ العُرَاةَ العَالَةَ رِعَاءَ الشَّاءِ يَتَطَاوَلُوْنَ فِي البُنْيَانِ))
    ///
    /// ثْمَّ انْطَلَقَ فَلَبِثتُ مَلِيَّاً ثُمَّ قَالَ
    ///
    /// ((يَا عُمَرُ أَتَدْرِي مَنِ السَّائِلُ؟))
    ///
    /// قُلْتُ اللهُ وَرَسُوله أَعْلَمُ قَالَ:
    ///
    /// ((فَإِنَّهُ جِبْرِيْلُ أَتَاكُمْ يُعَلَّمُكُمْ دِيْنَكُمْ))
    ///
    /// .رواه مسلم
    public static let hadeeth2 = L10n.tr(
        "Localizable",
        "hadeeth_2",
        fallback: "نْ عُمَرَ رَضِيَ اللهُ تَعَالَى عَنْهُ أقَال : بَيْنَمَا نَحْنُ جُلُوْسٌ عِنْدَ رَسُولِ اللهِ ذَاتَ يَوْمٍ إَذْ طَلَعَ عَلَيْناَ رَجُلٌ شَدِيْدُ بَيَاضِ الثّياب شَدِيْدُ سَوَادِ الشَّعْرِ لاَ يُرَى عَلَيهِ أَثَرُ السَّفَرِ وَلاَ يَعْرِفُهُ مِنا أحَدٌ حَتى جَلَسَ إلَى النبِي فَأَسْنَدَ رُكْبَتَيْهِ إلَى رُكْبَتَيْهِ وَوَضَعَ كَفيْهِ عَلَى فَخِذِيْهِ وَقَالَ : يَا مُحَمَّدُ أَخْبِرْنِي عَنِ الإِسْلاَم ، فَقَالَ رَسُولُ اللهِ ﷺ : \n\n((الإِسْلاَمُ أَنْ تَشْهَدَ أَنْ لاَ إلَه إلاَّ اللهُ وَأَنَّ مُحَمَّدَاً رَسُولُ الله ، وَتُقِيْمَ الصَّلاَة ، وَتُؤْتِيَ الزَّكَاةَ ، وَتَصُوْمَ رَمَضَانَ ، وَتَحُجَّ البيْتَ إِنِ اِسْتَطَعتَ إِليْهِ سَبِيْلاً))\n\n قَالَ: صَدَقْتَ. فَعجِبْنَا لَهُ يَسْأَلُهُ وَيُصَدِّقُهُ، قَالَ: فَأَخْبِرِنيْ عَنِ الإِيْمَانِ، قَالَ: \n\n((أَنْ تُؤمِنَ بِالله، وَمَلاِئكَتِه، وَكُتُبِهِ ، وَرُسُلِهِ ، وَالْيَومِ الآَخِر ، وَتُؤْمِنَ بِالقَدَرِ خَيْرِهِ وَشَرِّهِ))\n\nقَالَ: صَدَقْتَ، قَالَ فَأخْبِرْنِيْ عَنِ الإِحْسَانِ، قَالَ: \n\n((أَنْ تَعْبُدَ اللهَ كَأَنَكَ تَرَاهُ، فَإِنْ لمْ تَكُنْ تَرَاهُ فَإِنَّهُ يَرَاكَ ))\n\nقَالَ: فَأَخْبِرْنِي عَنِ السَّاعَةِ ، قَالَ :\n\n((مَا الْمَسئُوُلُ عَنْهَا بِأَعْلَمَ مِنَ السَّائِلِ))\n\nقَالَ : فَأخْبِرْنِيْ عَنْ أَمَارَاتِها ، قَالَ :\n\n((أَنْ تَلِدَ الأَمَةُ رَبَّتَهَا ، وَأَنْ تَرى الحُفَاةَ العُرَاةَ العَالَةَ رِعَاءَ الشَّاءِ يَتَطَاوَلُوْنَ فِي البُنْيَانِ))\n\nثْمَّ انْطَلَقَ فَلَبِثتُ مَلِيَّاً ثُمَّ قَالَ\n\n((يَا عُمَرُ أَتَدْرِي مَنِ السَّائِلُ؟))\n\nقُلْتُ اللهُ وَرَسُوله أَعْلَمُ قَالَ:\n\n((فَإِنَّهُ جِبْرِيْلُ أَتَاكُمْ يُعَلَّمُكُمْ دِيْنَكُمْ))\n\n.رواه مسلم")
    /// ليس فقط النوم المريح ما اكتسبت بالعشاء, بالنصف قيام الليل الأول, وما ادراك ما نصف قيام الليل
    public static let ishaaReward = L10n.tr(
        "Localizable",
        "ishaa_reward",
        fallback: "ليس فقط النوم المريح ما اكتسبت بالعشاء, بالنصف قيام الليل الأول, وما ادراك ما نصف قيام الليل")
    /// غير انها سنة عن النبي, بل انها ايضا تساعدك في قيام الليل
    public static let ishaaSunnahReward = L10n.tr(
        "Localizable",
        "ishaa_sunnah_reward",
        fallback: "غير انها سنة عن النبي, بل انها ايضا تساعدك في قيام الليل")
    /// لا إله إلا الله وحده لا شريكَ له، له الملك، وله الحمد، وهو على كل شيءٍ قدير
    public static let laIlahIlaAllah = L10n.tr(
        "Localizable",
        "la_ilah_ila_allah",
        fallback: "لا إله إلا الله وحده لا شريكَ له، له الملك، وله الحمد، وهو على كل شيءٍ قدير")
    /// لا إله إلا الله وحده لا شريكَ له، له الملك، وله الحمد، وهو على كل شيءٍ قدير لا حول ولا قوة إلا بالله, لا إله إلا الله, ولا نعبد إلا إياه, له النعمة, وله الفضل, وله الثناء الحسن
    public static let laIlahIlaAllahLaHawlWalaQwataIlaBellah = L10n.tr(
        "Localizable",
        "la_ilah_ila_allah_la_hawl_wala_qwata_ila_bellah",
        fallback: "لا إله إلا الله وحده لا شريكَ له، له الملك، وله الحمد، وهو على كل شيءٍ قدير لا حول ولا قوة إلا بالله, لا إله إلا الله, ولا نعبد إلا إياه, له النعمة, وله الفضل, وله الثناء الحسن")
    /// لا إله إلا الله وحده لا شريكَ له، له الملك، وله الحمد، يُحيي ويُميت، وهو على كل شيءٍ قدير
    public static let laIlahIlaAllahWahdah = L10n.tr(
        "Localizable",
        "la_ilah_ila_allah_wahdah",
        fallback: "لا إله إلا الله وحده لا شريكَ له، له الملك، وله الحمد، يُحيي ويُميت، وهو على كل شيءٍ قدير")
    /// كُتِبَ له عشر حسناتٍ، ومُحِيَ عنه عشر سيئاتٍ، ورُفِعَ له عشر درجاتٍ، وكان يومه ذلك كلّه في حرزٍ من كل مكروهٍ، وحُرِسَ من الشَّيطان، ولم ينبغِ لذنبٍ أن يُدركه في ذلك اليوم، إلا الشِّرك بالله
    public static let laIlahIlaAllahWahdahReward = L10n.tr(
        "Localizable",
        "la_ilah_ila_allah_wahdah_reward",
        fallback: "كُتِبَ له عشر حسناتٍ، ومُحِيَ عنه عشر سيئاتٍ، ورُفِعَ له عشر درجاتٍ، وكان يومه ذلك كلّه في حرزٍ من كل مكروهٍ، وحُرِسَ من الشَّيطان، ولم ينبغِ لذنبٍ أن يُدركه في ذلك اليوم، إلا الشِّرك بالله")
    /// اللهم لا مانع لما أعطيت ولا معطي لما منعت
    public static let laMani3LemaA3tyt = L10n.tr(
        "Localizable",
        "la_mani3_lema_a3tyt",
        fallback: "اللهم لا مانع لما أعطيت ولا معطي لما منعت")
    /// هنئا لك, اصبح مالك, و دعاءك, و امنياتك مباركة, و ان شاء الله يفيض الله عليك ببركات, هذا ما كسبت من صلاة المغرب
    public static let maghribReward = L10n.tr(
        "Localizable",
        "maghrib_reward",
        fallback: "هنئا لك, اصبح مالك, و دعاءك, و امنياتك مباركة, و ان شاء الله يفيض الله عليك ببركات, هذا ما كسبت من صلاة المغرب")
    /// كان صلي الله عليه و سلم لا يترك ركعتان ما بعد المغرب لفضلهم
    public static let maghribSunnahReward = L10n.tr(
        "Localizable",
        "maghrib_sunnah_reward",
        fallback: "كان صلي الله عليه و سلم لا يترك ركعتان ما بعد المغرب لفضلهم")
    /// لا إله إلا الله، مخلصين له الدين ولو كره الكافرون
    public static let mokhlseenLahoLDeen = L10n.tr(
        "Localizable",
        "mokhlseen_laho_l_deen",
        fallback: "لا إله إلا الله، مخلصين له الدين ولو كره الكافرون")
    /// تاريخ اليوم
    public static let pickDate = L10n.tr("Localizable", "pick_date", fallback: "تاريخ اليوم")
    /// صلاة %@
    public static func prayerTitle(_ p1: Any) -> String {
        L10n.tr("Localizable", "prayer_title", String(describing: p1), fallback: "صلاة %@")
    }

    /// سلسلة الصلاوات
    public static let prayingStreak = L10n.tr("Localizable", "praying_streak", fallback: "سلسلة الصلاوات")
    /// شرف المؤمن, و اختص الله هذه الصلاة في الثلث الأخير من انه يتنزل الي السماء الدنيا فينادي علي عباده,هل من سائل فيعطى سؤله، هل من داع فيستجاب له، هل من مستغفر فيغفر له هل من تائب، فيتاب عليه؟, بل من معزة مصليها عند ربهم, يشع نور من بيته كل ليلة, حتي اذا غاب سئلت عنه الملائكة و دعت له اذا علمت بمرضه بالشفاء و استغفرت له
    public static let qeyamAlLaylReward = L10n.tr(
        "Localizable",
        "qeyamAlLayl_reward",
        fallback: "شرف المؤمن, و اختص الله هذه الصلاة في الثلث الأخير من انه يتنزل الي السماء الدنيا فينادي علي عباده,هل من سائل فيعطى سؤله، هل من داع فيستجاب له، هل من مستغفر فيغفر له هل من تائب، فيتاب عليه؟, بل من معزة مصليها عند ربهم, يشع نور من بيته كل ليلة, حتي اذا غاب سئلت عنه الملائكة و دعت له اذا علمت بمرضه بالشفاء و استغفرت له")
    /// Plural format key: "%#@raqaatCount@"
    public static func raqaatCount(_ p1: Int) -> String {
        L10n.tr("Localizable", "raqaat_count", p1, fallback: "Plural format key: \"%#@raqaatCount@\"")
    }

    /// بعد
    public static let raqaatPositionAfter = L10n.tr("Localizable", "raqaat_position_after", fallback: "بعد")
    /// قبل
    public static let raqaatPositionBefore = L10n.tr("Localizable", "raqaat_position_before", fallback: "قبل")
    /// سبحان الله
    public static let subhanAllah = L10n.tr("Localizable", "subhan_allah", fallback: "سبحان الله")
    /// (مؤكدة)
    public static let sunnahAffirmed = L10n.tr("Localizable", "sunnah_affirmed", fallback: "(مؤكدة)")
    /// (مستحبة)
    public static let sunnahDesired = L10n.tr("Localizable", "sunnah_desired", fallback: "(مستحبة)")
    /// %@ %@ %@
    public static func sunnahSubtitle(_ p1: Any, _ p2: Any, _ p3: Any) -> String {
        L10n.tr(
            "Localizable",
            "sunnah_subtitle",
            String(describing: p1),
            String(describing: p2),
            String(describing: p3),
            fallback: "%@ %@ %@")
    }

    /// سنة %@ %@
    public static func sunnahTitle(_ p1: Any, _ p2: Any) -> String {
        L10n.tr("Localizable", "sunnah_title", String(describing: p1), String(describing: p2), fallback: "سنة %@ %@")
    }

    /// المهام
    public static let tasks = L10n.tr("Localizable", "tasks", fallback: "المهام")
    /// Plural format key: "%#@timesCount@"
    public static func timesCount(_ p1: Int) -> String {
        L10n.tr("Localizable", "times_count", p1, fallback: "Plural format key: \"%#@timesCount@\"")
    }

    /// محصلة اليوم
    public static let todaySummary = L10n.tr("Localizable", "today_summary", fallback: "محصلة اليوم")
    /// %@/%@ (%@)
    public static func todaySummaryNumeric(_ p1: Any, _ p2: Any, _ p3: Any) -> String {
        L10n.tr(
            "Localizable",
            "today_summary_numeric",
            String(describing: p1),
            String(describing: p2),
            String(describing: p3),
            fallback: "%@/%@ (%@)")
    }

    /// إذا قرأت ٧ ايات بعد صلاة العشاء, فقد كتبت من من قام هذه الليلة
    public static let wetrReward = L10n.tr(
        "Localizable",
        "wetr_reward",
        fallback: "إذا قرأت ٧ ايات بعد صلاة العشاء, فقد كتبت من من قام هذه الليلة")
}

// swiftlint:enable explicit_type_interface function_parameter_count identifier_name line_length
// swiftlint:enable nesting type_body_length type_name vertical_whitespace_opening_braces

// MARK: - Implementation Details

extension L10n {
    private static func tr(_ table: String, _ key: String, _ args: CVarArg..., fallback value: String) -> String {
        let format = BundleToken.bundle.localizedString(forKey: key, value: value, table: table)
        return String(format: format, locale: Locale.current, arguments: args)
    }
}

// MARK: - BundleToken

// swiftlint:disable convenience_type
private final class BundleToken {
    static let bundle: Bundle = {
        #if SWIFT_PACKAGE
        return Bundle.module
        #else
        return Bundle(for: BundleToken.self)
        #endif
    }()
}

// swiftlint:enable convenience_type
